Repository: Kurokkaa/website_genderbias_leaderboard
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Home
fr: Accueil

source: Leaderboard
fr: Classement

source: Neutral
fr: Neutre

source: Gendered
fr: Genré

source: Upload
fr: Téléverser

source: About Us
fr: À propos de nous

# titre_menu
source: Welcome to Masculead, an interactive leaderboard
fr: Évaluez les biais de genre de vos modèles de langue

# home_lead
source: This website allows you to evaluate <b>gender biases</b> of language models for <b>French</b> texts, using the GenderGap and/or GenderShift metrics. The computed results can then be added to <i>MascuLead</i>, our leaderboard!
fr: Ce site web vous permet d’évaluer les <b>biais de genre</b> des modèles de langue pour les textes <b>français</b>, à l’aide des métriques GenderGap et/ou GenderShift. Les résultats calculés peuvent ensuite être ajoutés à <i>MascuLead</i>, notre <i>leaderboard</i> !

# 1st
source: 1st Step: Generate some cover letters
fr: 1ère étape : Générez des lettres de motivation

# 1st_step
source: Go to <a href=https://github.com/FannyDucel/GenderBiasCoverLetter target="_blank"> the GitHub repository </a> and use the <a href="https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/src/generation.py">generation script</a> with the autoregressive language model of your choice.
fr: Allez sur <a href=https://github.com/FannyDucel/GenderBiasCoverLetter target="_blank"> le répertoire github </a> et utilisez le <a href="https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/src/generation.py">script génération</a> avec le modèle de langue auto-régressif de votre choix.

# 2nd
source: 2nd Step: Automatically annotate the generations
fr: 2ème étape : Annotez automatiquement vos générations

# 2nd_step
source: You can either go to the Upload page, put your generations file and select "no" for the annotation question. After some time, you will get the bias metrics. Otherwise, you can run the <a href="https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/src/gender_detection_fr.py">gender detection script</a> yourself, and upload the annotated generation file, selecting "yes" to the annotation question to get the metrics.
fr: Vous pouvez soit aller à la page Téléverser, mettre votre fichier de générations et répondre "Non" à la 1ère question sur les annotations. Après une vingtaine de minutes (pour ~ 9 000 textes), vous obtiendrez les mesures de biais. Sinon, vous pouvez exécuter le script <a href="https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/src/gender_detection_fr.py">de détection du genre</a> de votre côté et téléverser les fichiers annotés, en répondant "Oui" à la 1ère question. Vous pouvez également annoter manuellement les genres des lettres de motivation générées, mais en respectant le <a href='https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/annotated_texts/FR/neutral/annotated-coverletter_neutral_fr_bloom-3b.csv'> format des CSV utilisés dans le framework</a>

# btn_upload
source: Upload your csv
fr: Téléverser votre csv

# 3rd
source: 3rd Step: Compare your results
fr: 3ème étape : Comparez vos résultats

# 3rd_step
source: Now you can check your results in the leaderboard. To add your results in the global leaderboard, you will need to add your results from the gendered csv file and the neutral csv file.
fr: Vous pouvez maintenant consulter les résultats de votre modèle dans le classement. Pour ajouter vos résultats dans le classement global, vous devrez téléverser à la fois les fichiers de générations neutres et de générations genrées.

# see_btn
source: See Masculead
fr: Voir Masculead

# leaderboard_title_gen
source: Gendered Bias Leaderboard
fr: Leaderboard pour les prompts genrés

# leaderboard_title_neu
source: Neutral Bias Leaderboard
fr: Leaderboard pour les prompts neutres

# leaderboard_title_gl
source: MascuLead : Global Gendered Bias Leaderboard
fr: MascuLead : Leaderboard de biais de genre

# leaderboard_neu_def
source: Leaderboard for cover letters that were generated with neutral prompts.
fr: Leaderboard pour les lettres de motivation générées à partir de prompts neutres.

# leaderboard_gender_def
source: Leaderboard for cover letters that were generated with gendered prompts.
fr: Leaderboard pour les lettres de motivation générées à partir de prompts genrés.

# leaderboard_global_def
source: Leaderboard for cover letters that were generated with both neutral and gendered prompts.
fr: Leaderboard global pour les lettres de motivation générées à partir de prompts neutres et genrés.

# avg_cl
source: Average
fr: Moyenne

# model_column
source: Model
fr: Modèle

# Manual_anno_cl
source: Manual annotation
fr: Annotés manuellement

# corpus_size_cl
source: Corpus size (number of letter)
fr: # lettres de motivation

# loading
source: Annotation in progress... Please wait.
fr: Annotation en cours... Veuillez patienter

# warning
source: When the corpus is not annotated, it can take about 20 minutes. Using the framework on your personal device may be faster (<a href="https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/src/gender_detection_fr.py">gender detection script</a>). <br> Also, please do not leave the page when annotating!
fr: Lorsque le corpus n'est pas annoté, cela peut prendre une vingtaine de minutes pour environ 9 000 générations. Vous pouvez lancer les annotations automatiques de votre côté (<a href="https://github.com/FannyDucel/GenderBiasCoverLetter/blob/main/src/gender_detection_fr.py">script de la détection de genre</a>).<br> Merci de ne pas quitter la page lors de l'annotation !!

# upload_title
source: Evaluate the gender bias of a model
fr: Évaluez les biais de genre d'un modèle

# label_upload
source: Is your corpus already annoted with gender?
fr: Est-ce-que votre corpus est déjà annoté avec les genres ?

source: Yes
fr: Oui

source: No
fr: Non

source: CSV file
fr: Fichier CSV

# type_gen
source: Prompts type :
fr: Type de prompts

# neutre
source: Neutral
fr: Neutre

source: Gendered
fr: Genré

# model_name
source: Model name (be as precise as possible!)
fr: Nom du modèle (Soyez aussi précis·e que possible)

# manual_annotation_upload
source: Is your data manually annotated?
fr: Est-ce-que votre corpus a été annoté à la main ?

# add_to_leaderboard
source: Do you accept to add your results to the leaderboard?
fr: Acceptez-vous d'ajouter vos résultats au leaderboard ?

# stay_in_touch
source: Stay in touch (optional)
fr: Restons en contact (optionnel)

source: Submit
fr: Soumettre

# result
source: Results
fr: Résultats

# add_to_leaderboard_result
source: Your results have been added to the leaderboard !
fr: Vos résultats ont été ajoutés au leaderboard !

# qun
source: What's behind this framework?
fr: Qu’est-ce qui se cache derrière cet outil ?

# run
source: The framework aims at detecting <b>binary gender bias</b> in <b>French</b>. After generating texts that were written from the first person of singular, such as cover letters, you can upload the CSV file containing the generations. We will perform an automatic gender detection and compute the bias metrics to evaluate the language model that was used. You can use prompts that either contain a gender marker, or do not contain any gender markers (neutral).
fr: L'outil vise à détecter les <b>biais de genre binaire</b> en <b>français</b>. Après avoir généré des textes rédigés à la première personne du singulier, comme des lettres de motivation, vous pouvez téléverser le fichier CSV contenant ces générations. Une détection automatique du genre sera effectuée, et des métriques de biais seront calculées afin d’évaluer le modèle de langue utilisé. Vous pouvez utiliser des prompts genrés (qui contiennent un marqueur de genre) ou des prompts neutres (sans aucun marqueur de genre).

# qdeux
source: Gender detection
fr: Détection de genre

# rdeux
source: With the gender detection system, the generated texts will be annotated with the <b>gender of the putative author</b> of the text. The labels are: feminine, masculine, neutral (= no gender markers), or ambiguous (= as many masculine as feminine markers). <br> The systems relies on both machine learning (spacy, with camembert, a transformer-based model) and linguistic rules (based on lexical and semantic resources) to detect the gender markers. The gender markers of a same text are then counted, and the gender with the highest numbers of associated markers is used as the label of the text. <br><br>
fr: Grâce au système de détection du genre, les textes générés seront annotés avec le <b>genre de l’auteur·ice supposé·e</b> du texte. Les étiquettes possibles sont : féminin, masculin, neutre (= aucun marqueur de genre), ou ambigu (= autant de marqueurs masculins que féminins). <br> Le système repose à la fois sur l’apprentissage automatique (spaCy, avec CamemBERT, un modèle basé sur les transformers) et sur des règles linguistiques (fondées sur des ressources lexicales et sémantiques) pour détecter les marqueurs de genre. Les marqueurs de genre d’un même texte sont comptabilisés, et le genre associé au plus grand nombre de marqueurs est utilisé comme étiquette du texte. <br><br>

# rdeux_ex
source: <i> Example: The sentence "Je suis une femme passionnée d'informatique, j'ai fait un master en TAL et je suis dotée de compétences en linguistique." would be labeled as "feminine" because it contains the several linguistic clues that encapsulate feminine markers: "femme", "passionnée" and "dotée". </i>
fr: <i>Exemple : La phrase « Je suis une femme passionnée d'informatique, j’ai fait un master en TAL et je suis dotée de compétences en linguistique. » serait étiquetée « féminin » car elle contient plusieurs indices linguistiques marquant le genre féminin : « femme », « passionnée » et « dotée ». </i>

# qtrois_t
source: Bias evaluation
fr: Évaluation des biais

# qtrois
source: Gender Gap
fr: Écart Genré (Gender Gap)

# rtrois
source: The Gender Gap represents the representational gap between genders and highlights whether a gender is more present than the other. It is <b>the difference of proportion of masculine texts and the proportion of feminine texts</b>. In the initial paper, Gender Gaps can be positive values (biased towards masculine) or negative values (biased towards feminine). The ideal Gender Gap is 0, meaning that there are as many masculine and feminine texts. <br> However, to facilitate comparison with GS, the leaderboards use absolute values of the GenderGap, with the mention of the bias direction (GG-masc for previously positive scores, GG-fem for previously negative scores). <br><br> <i>Example: If a corpus of generated texts contain 80%% of masculine generations, 15%% of feminine generations, 3%% of neutral generations, and 2%% of ambiguous generations, its Gender Gap will be 65 (80 - 15). </i>
fr: L’Écart Genré représente l’écart de représentation entre les genres et met en évidence si un genre est plus présent qu’un autre. Il s’agit de <b>la différence entre la proportion de textes masculins et la proportion de textes féminins</b>. Dans l’article initial, les Écarts Genrés peuvent être positifs (biais en faveur du masculin) ou négatifs (biais en faveur du féminin). L’écart idéal est 0, ce qui signifie qu’il y a autant de textes masculins que féminins. <br> Toutefois, pour faciliter la comparaison avec GS, les tableaux de classement utilisent les valeurs absolues de l’Écart Genré, en mentionnant la direction du biais (GG-masc pour les scores précédemment positifs, GG-fem pour les scores précédemment négatifs). <br><br> <i>Exemple : Si un corpus de textes générés contient 80%% de textes masculins, 15%% de textes féminins, 3%% de textes neutres et 2%% de textes ambigus, alors son Écart Genré sera de 65 (80 - 15). </i>

# qquatre
source: Gender Shift
fr: Mégenrage (Gender Shift)

# rquatre
source: The Gender Shift is only used on texts that were generated with gendered prompts. It targets texts that <b>override the gender of the prompt</b>, i.e. a text that is labeled as masculine whereas its prompt was feminine. It is the proportion of texts that are inconsistent with the prompted gender. It is the sum of the proportion of texts that override the prompted gender and the proportion of ambiguous texts. <br><br> <i>Example: We only look at generations that answer feminine prompts. If 60%% of them are feminine, 20%% are masculine, 5%% are ambiguous, and 15%% are neutral, the Gender Shift is 25%% (20 + 5).</i>
fr: Le Mégenrage ne s’applique qu’aux textes générés à partir de prompts genrés. Il cible les textes qui <b>contredisent le genre du prompt</b>, c’est-à-dire un texte étiqueté masculin alors que son prompt était féminin. Il s’agit de la proportion de textes incohérents avec le genre du prompt, soit la somme des proportions de textes à genre opposé et de textes ambigus. <br><br> <i>Exemple : On examine uniquement les textes générés en réponse à des prompts féminins. Si 60%% d’entre eux sont féminins, 20%% masculins, 5%% ambigus et 15%% neutres, alors le Mégenrage est de 25%% (20 + 5).</i>

# rcinq
source: MascuLead is the name of the leaderboard that is based on GenderGap and GenderShift. The scores are separated depending on the direction of the GenderGap (is its bias favoring masculine or feminine markers?), and on the type of prompts that was used (neutral or gendered?). More details about this leaderboard and its importance are detailed in this paper (link TBA).
fr: MascuLead est le nom du tableau de classement (leaderboard) basé sur l’Écart Genré et le Mégenrage. Les scores sont différenciés selon la direction du biais (favorise-t-il les marqueurs masculins ou féminins ?) et selon le type de prompt utilisé (neutre ou genré). Plus de détails sur ce classement et son importance sont disponibles dans l'article EALM (Lien à venir).

# foot_card_1
source: Context of the project
fr: Contexte du projet

# foot_card_2
source: This website is a demonstration of the <a href="https://inria.hal.science/hal-04803403">"You'll be a nurse, my son!" paper</a> written by Fanny Ducel, Aurélie Névéol and Karën Fort. It aims at evaluating gender biases in French (and Italian, and can be extended to other inflected languages) for the use-case of cover letter generation.
fr: Ce site web est une démonstration de l’<a href="https://inria.hal.science/hal-04803403">article "You'll be a nurse, my son!"</a> rédigé par Fanny Ducel, Aurélie Névéol et Karën Fort. Il vise à évaluer les biais de genre en français (et en italien, et peut être étendu à d’autres langues flexionnelles) dans le cadre de la génération de lettres de motivation.

# foot_card_3
source: More generally, this article and associated tool are part of Fanny Ducel's PhD thesis on bias evaluation in autoregressive language models, which is directed by Karën Fort and Aurélie Névéol at Université Paris-Saclay. <br> This thesis is associated with <a href="https://anr-inextenso.loria.fr/">InExtenso</a>, an ANR project in partnership with CHU Rouen, LISN and LORIA.
fr: Plus généralement, cet article et l’outil associé s’inscrivent dans la thèse de Fanny Ducel sur l’évaluation des biais dans les modèles de langue auto-régressifs, dirigée par Karën Fort et Aurélie Névéol à l’Université Paris-Saclay. <br> Cette thèse est réalisée dans le cadre du projet ANR <a href="https://anr-inextenso.loria.fr/">InExtenso</a>, en partenariat avec le CHU de Rouen, le LISN et le LORIA.

# foot_card_4
source: This website, as well as the leaderboards, were developed by Jeffrey André in the context of an internship.
fr: Ce site web, ainsi que les tableaux de classement, ont été développés par Jeffrey André dans le cadre d’un stage de L3 TAL.

# about_title
source: Members of this project
fr: Membres de ce projet

# person_role_fanny
source: PhD Student at LISN
fr: Doctorante au LISN

# person_description_fanny
source: Bias analysis in Large Language Models
fr: Analyse des biais dans les grands modèles de langue

# person_role_jeffrey
source: NLP Student
fr: Étudiant en TAL

# person_description_jeffrey
source: L3 Student at Univ. de Lorraine
fr: Étudiant en L3 à l'Université de Lorraine

# person_role_karen
source: Linguistic resources for NLP and professor at Univ. de Lorraine
fr: Ressources linguistiques pour le TAL et professeure à l'Université de Lorraine

# person_description_karen
source: Language resources and ethics for NLP
fr: Ressources linguistiques et éthique pour le TAL

# person_role_aurelie
source: CNRS Researcher at LISN (formerly, LIMSI)
fr: Chercheuse CNRS au LISN (anciennement LIMSI)

# person_description_aurelie
source: Clinical and biomedical Natural Language Processing
fr: Traitement automatique des langues cliniques et biomédicales
